
##########
#  Presage, an extensible predictive text entry system
#  ------------------------------------------------------
#
#  Copyright (C) 2008  Matteo Vescovi <matteo.vescovi@yahoo.co.uk>
#  Copyright (C) 2008  Tiziano D'Albis
#
#  This program is free software; you can redistribute it and/or modify
#  it under the terms of the GNU General Public License as published by
#  the Free Software Foundation; either version 2 of the License, or
#  (at your option) any later version.
#
#  This program is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#  GNU General Public License for more details.
#
#  You should have received a copy of the GNU General Public License along
#  with this program; if not, write to the Free Software Foundation, Inc.,
#  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.

## Vocab generated by v2 of the CMU-Cambridge Statistcal
## Language Modeling toolkit.
##
## Includes 20000 words ##
a
aaaah
aaagh
aaargh
aagh
aah
aargh
aaron
ab
abandon
abandoned
abba
abbey
abbie
abbot
abbots
abbott
abbreviated
abdicated
abdullah
aberdeen
abergavenny
abers
aberystwyth
abide
abilities
ability
able
abnormal
abo
aboard
abode
abolish
abortion
abou
about
abouts
above
abraham
abrasive
abroad
abruptly
abs
absconded
absence
absent
abso
absolute
absolutely
absorb
absorbed
absorbent
absorbs
abu
abugally
abundance
abundant
abuse
abused
abusive
abutment
abutting
abysmal
ac
acacia
academic
academy
acc
acce
accelerator
accent
accents
accept
acceptable
accepted
accepting
accepts
access
accessories
accessory
accident
accidentally
accidents
acclaimed
accommodate
accommodation
accompany
accomplice
accord
according
accordingly
accost
accosted
account
accountable
accountancy
accountant
accountants
accounted
accounting
accounts
accrington
accumulate
accuracy
accurate
accurately
accusations
accuse
accused
accuses
accusing
ace
acerous
aces
acetic
ach
achanical
ache
aches
achieve
achieved
achievement
achieving
aching
achy
acid
acidity
acidy
ack
ackman
acknowledge
acknowledged
acky
acne
acoustic
acoustics
acquaintances
acquainted
acquired
acre
acreage
acres
acro
acrobat
acrobatic
acrobatics
across
act
acted
actifed
acting
action
actions
activated
active
activities
activity
actor
actors
actress
actresses
acts
actu
actual
actually
ad
adam
adamant
adams
adapt
adapted
adaptor
add
addams
added
addicted
addictive
addicts
adding
addington
addition
additional
additionally
additive
additives
address
addressed
addresses
addressing
adds
adele
adem
aden
adenoids
adequately
adidas
adie
adjoining
adjoins
adjourned
adjudication
adjudicator
adjust
adjustable
adjusted
adjusting
adjustment
adjusts
adler
admin
administer
administration
administrations
admiral
admiration
admire
admired
admirer
admiring
admissible
admission
admissions
admit
admits
admitted
admittedly
admitting
ado
adopt
adopted
adopting
adoption
adorable
adore
adores
adoring
adrenalin
adrian
adriatic
ads
adult
adultery
adults
advance
advanced
advances
advantage
advantageous
advantages
advent
adventure
adventurous
advert
advertise
advertised
advertisement
advertisements
advertiser
advertising
advertized
adverts
advice
advisable
advise
advised
advising
advisor
advisory
advocaat
aegean
aerhart
aerial
aerials
aero
aerobic
aerobics
aeroplane
aeroplanes
aerosol
aerospace
aewa
af
affair
affairs
affect
affected
affecting
affection
affects
affidavit
affidavits
afford
afforded
affording
afghan
afghanistan
aflex
afoot
afraid
africa
african
afro
aft
after
afternoon
afternoons
afters
aftershave
afterward
afterwards
ag
aga
again
against
agas
age
aged
ageing
agencies
agency
agenda
agent
agents
ages
aggravate
aggravated
aggravating
aggravation
aggregate
aggressive
aggro
aging
agitated
agm
agnes
ago
agony
agree
agreeable
agreed
agreeing
agreement
agrees
agricultural
ah
aha
ahah
ahead
ahem
ahh
ahhed
ahhh
ahhhh
ahm
ai
aid
aiden
aids
aileen
ailments
aim
aimed
aiming
ain
air
airbus
aircraft
airing
airline
airlines
airman
airport
airs
airstream
airtexed
airways
airy
aisle
aisles
aisling
ajar
akela
al
alabama
alacio
aladdin
alan
alana
alarm
alarms
alaska
alb
alban
albans
albany
albeit
albert
album
albums
alchemist
alchemy
alcohol
alcoholic
alcoholics
alcove
aldeburgh
alders
aldershot
aldos
aldringham
ale
alec
alert
alex
alexander
alexandra
alf
alfie
alfiera
alfred
algate
algebra
algeria
algiers
ali
alia
alias
alibi
alice
alices
alicia
alien
alight
alike
alimony
aline
alison
alistair
alistaire
alistare
alive
all
allan
allard
allay
alleged
allegedly
allen
allergic
allergies
allergy
allerton
alleviate
alley
alleycat
alleyway
alliance
allied
alligator
alligators
alliteration
allocate
allocated
allocation
allotment
allotted
allow
allowance
allowances
allowed
allowing
allows
alloy
alloys
allsort
allsorts
ally
allyson
alma
almighty
almo
almond
almonds
almost
alms
alone
along
alongside
aloud
alpen
alphabet
alphabetical
alpina
alpine
alr
already
alri
alright
alsatian
also
alston
alt
alter
alterations
altered
altering
alternate
alternative
alternatively
alternatives
alternator
alters
although
altogether
alton
altrincham
aluminium
alvin
alvio
alw
always
alwight
alzheimer
am
amanda
amateur
amateurs
amazed
amazes
amazing
amazingly
amaznig
amazon
amber
ambidextrous
ambiguity
ambition
ambitious
ambrosia
ambulance
ambulances
amd
ame
amen
amer
america
american
americanize
americans
amicable
amiga
amington
amiss
ammeter
ammonia
ammunition
amnio
among
amongst
amorous
amount
amounts
amp
ample
amplifier
amps
amputated
amsterdam
amstrad
amuse
amused
amusements
amusing
amy
an
ana
anadin
anaesthetic
anaesthetist
anagram
anagrams
anal
analogy
analyse
analysis
analyze
analyzed
analyzing
anasleen
anastasia
anatomy
ancestors
anchor
anchors
ancient
and
anderson
andover
andre
andrea
andrew
andrews
andrex
ands
andy
ang
ange
angel
angela
angelic
angeline
angeliques
angelo
angels
anger
angie
angina
angle
angles
anglia
anglian
anglican
angola
angora
angrily
angry
animal
animals
animated
anita
ankle
ankles
ann
anna
annabel
annalise
anne
anneka
annette
annexe
annick
annie
annika
anniversaries
anniversary
announce
announced
announcement
announcements
announcing
annoy
annoyance
annoyed
annoying
annoys
annual
ano
anointed
anona
anonymity
anonymous
anonymously
anorak
anorexic
anot
another
ans
answ
answer
answerable
answered
answering
answers
ant
antagonistic
anth
anthem
anthony
anthy
anti
antibiotic
antibiotics
anticipated
anticipation
antics
antidisestablishmentarianism
antiquated
antique
antiques
antiseptic
anton
antrim
ants
anwick
anxiety
anxious
any
anybody
anyhow
anymore
anyone
anyroad
anything
anytime
anyway
anyways
anywhere
aorta
ap
apache
apart
apartment
apartments
ape
apes
apeshit
apex
aphrodisiac
aphrodisiacal
apiece
apocalypse
apologies
apologise
apologising
apologize
apologized
apologizing
apology
apostle
apostles
apostrophe
app
appalled
appalling
appallingly
appar
apparent
apparently
appeal
appealed
appealing
appeals
appear
appearance
appearances
appeared
appearing
appears
appendix
appetit
appetite
appetizing
apple
apples
appletise
appliances
applicants
application
applications
applied
applies
apply
applying
appoint
appointed
appointment
appointments
appraisal
appreciate
appreciated
appreciates
appreciating
appreciation
apprehension
apprentice
apprentices
approach
approached
approaching
appropriate
approval
approve
approved
approximately
appy
apricot
apricots
april
apron
aprons
apton
aqua
aquaplaning
aquarium
aquarius
aquatic
aqueducts
ar
arabia
aran
aravalley
arcade
arch
archaeologist
archaeology
arched
archer
archie
architect
architects
architectural
architecture
archive
archived
archives
archiving
archway
arctic
ardilles
ards
are
area
areas
aren
arf
argentina
argentine
argh
arghh
argos
arguably
argue
argued
arguing
argument
argumentative
arguments
argyle
aries
arise
arithmetic
ark
arm
armada
armageddon
armagh
armament
armature
armband
armbands
armchair
armed
armful
armies
armour
armpit
armpits
arms
army
arnie
arnold
aroma
around
aroused
arpeggios
arrange
arranged
arrangement
arrangements
arranging
array
arrear
arrears
arrest
arrested
arresting
arrival
arrive
arrived
arrivederci
arrives
arriving
arrogant
arrow
arrows
arry
arse
arsed
arsehole
arseholes
arsenal
arsenic
arses
art
arteries
artery
artex
artexed
artexing
artfully
arthritis
arthur
article
articles
articulate
artificial
artillery
artist
artistic
artists
arts
artwork
as
ascertain
ascot
asda
asdas
asdir
ash
ashamed
ashdon
ashdown
ashfield
ashington
ashley
ashton
ashtray
ashtrays
asia
asian
asians
aside
asides
ask
asked
asking
asks
asleep
aspect
aspects
aspel
aspirin
ass
assassinated
assault
assemble
assemblies
assembly
assess
assessed
assessing
assessment
assessor
asset
assets
assignment
assignments
assistance
assistant
assistants
assisted
associate
associated
associates
association
associations
assortment
assume
assumed
assuming
assumption
assurance
assure
assured
asterix
asteroid
asthana
asthma
asthmatic
aston
astonished
astonishment
astor
astra
astray
astronomical
asymmetrical
at
atari
atch
atchoo
ate
athena
athlete
athletic
atkinson
atlantic
atlantis
atlas
atmosphere
atmospherics
atom
atrocious
ats
attach
attache
attached
attachment
attack
attacked
attacking
attacks
attainment
attempt
attempted
attempts
attend
attendance
attendants
attended
attending
attention
attic
attitude
attitudes
attract
attracted
attractive
attracts
attributes
au
auberge
aubern
auburn
auckland
auction
auctioning
auctions
audacity
audi
audience
audio
audit
audition
audrey
audyponch
aug
aught
august
aunt
auntie
aunties
aunts
aunty
aus
aussie
aussies
austin
austins
australia
australian
australians
austria
authentic
author
authorise
authorised
authorities
authority
authorization
authorized
authors
auto
autobiography
autograph
automatic
automatically
autonomous
autumn
auxiliary
availability
available
avcs
ave
avenger
avengers
avenue
average
averaged
averages
averaging
aviary
avila
avo
avocado
avocados
avoid
avoided
avoiding
avon
avril
aw
awake
awakening
award
awards
aware
away
aways
awful
awfully
awkward
axe
axed
axle
axles
axminster
ay
aye
aysha
azalea
azaleas
b
ba
baa
bab
baba
babbies
babbling
babby
babe
babes
babies
babkins
baby
babycham
babygro
babysit
babysitter
babysitters
babysitting
bacardi
baccy
bach
bachelor
bachelors
back
backdate
backdated
backed
background
backing
backs
backside
backspace
backstage
backup
backwards
bacon
bacup
bad
baddie
baddies
baddy
badge
badger
badgering
badges
badly
badminton
baffled
bag
bagged
baggy
bags
baguettes
bah
bahamas
bahrain
bail
bailey
baileys
bailiff
bailiffs
bailing
bairn
bait
bake
baked
bakelite
baker
bakers
bakery
bakewell
baking
bal
balance
balanced
balancing
balconies
balcony
bald
baldwin
baldy
bales
ball
baller
ballerina
ballet
ballinamore
balling
balloo
balloon
balloons
ballroom
balls
bally
ballymena
baloo
bam
bama
bamber
bambi
bamboo
ban
bana
banana
bananas
banbury
band
bandage
bandages
banding
bandit
bands
bandsaw
bandstand
bandwagon
bang
banged
banger
bangers
banging
bangkok
bangladesh
bangor
bank
banked
banker
banking
bankrupt
banks
banned
banning
bannister
banns
banquet
bantams
banw
baps
baptised
baptism
baptist
baptize
baptized
baptizing
bar
barb
barbados
barbara
barbecue
barbed
barber
barbers
barbican
barbie
barbra
barclay
barclaycard
barclays
bare
barely
bargain
bargains
barge
bark
barked
barker
barking
barks
barlen
barley
barm
barmaid
barman
barmy
barn
barnes
barnet
barnetby
barney
barns
barnsley
barometer
barometers
barraclough
barred
barrel
barrelage
barrelled
barrels
barrier
barriers
barring
barrister
barron
barrow
barry
barrymore
bars
bart
barter
barton
bas
base
baseball
based
basement
bases
bash
bashed
basher
bashful
bashing
basic
basically
basics
basil
basildon
basin
basinger
basingstoke
basis
basket
basketful
baskets
basque
bass
bassa
bassett
bastard
bastardo
bastards
bat
batch
batchelors
batches
bates
bath
bathed
bathing
bathroom
bathrooms
baths
batman
baton
bats
batted
batter
battered
batteries
battersea
battery
batting
battle
battled
battlestar
battling
batty
bawling
bay
bayleaf
bazaar
bbc
be
bea
beach
beaches
beacon
bead
beadle
beads
beaker
beam
beaming
beamish
beams
bean
beanbag
beanpole
beans
beanstalk
beany
bear
beard
beards
bearhug
bearing
bearings
bears
beast
beasties
beasts
beat
beaten
beater
beaters
beating
beatles
beatrice
beats
beattie
beatty
beau
beaut
beauties
beautiful
beautifully
beauty
beazley
bec
beca
became
becau
because
becca
beck
beckenham
beckett
becketts
becki
beckie
beckley
becky
become
becomes
becoming
bed
bedded
bedding
beddy
bedford
bedge
bedlam
bedlington
bedroom
bedroomed
bedrooms
beds
bedside
bedsit
bedspread
bedtime
bee
beech
beechers
beef
beefburger
beefburgers
beefy
beeline
been
beep
beeper
beer
beers
bees
beeswax
beethoven
beetle
beetlejuice
beetles
beetroot
bef
befo
before
beforehand
beg
began
beggar
beggars
begged
begger
begging
begin
beginners
beginning
begins
begonias
begun
behalf
behave
behaved
behaving
behaviour
behind
behold
beige
beigey
being
beings
bel
belfast
belfry
belgian
belgium
beli
belief
beliefs
believe
believed
believes
believing
belinda
belittle
belize
bell
bellamy
belle
bellise
bells
belly
belmont
belong
belonged
belonging
belongings
belongs
beloved
below
belt
belting
belts
ben
bench
benches
bend
bended
bender
bending
bends
bendy
beneath
beneficial
beneficiary
benefit
benefiting
benefits
benefitting
benetton
benidorm
benita
benj
benjamin
benji
benjy
bennett
bennetton
bennetts
benny
benolin
benson
bensons
bent
bentley
ber
beret
bergen
berk
berks
berkshire
berlin
bermondsey
bern
bernard
bernie
berries
berry
berserk
bert
berth
bertha
bertie
berty
berwick
beryl
beside
besides
besotted
bessacarr
bessie
best
bestest
bet
beta
betamax
beth
bethan
bethnal
betide
betnovate
betrayal
bets
bett
better
betting
betty
betwe
between
bev
beven
beverley
beware
bewildered
bewise
beyond
bi
biafran
bias
biased
bib
bible
bibles
biblical
bibliography
bibs
bic
bicarbonate
bicktons
bicycle
bicycles
bid
bidding
bidet
biff
big
bigger
biggest
biggie
biggins
biggish
biggs
bigheaded
bigots
bike
biker
bikers
bikes
biking
bikini
bilingual
bill
billed
billing
billion
bills
billy
bilton
bimbo
bin
bind
binding
bing
binge
bingley
bingo
binoculars
bins
biography
biological
biology
bionic
biopsy
birani
bird
birdie
birdies
birds
birkenhead
birkwood
birmingham
biro
biros
birth
birthday
birthdays
birthplace
bis
biscuit
biscuits
bishop
bison
bisto
bit
bitch
bitches
bitchiness
bitchy
bite
bites
biting
bits
bitsy
bitten
bitter
bitterly
bitty
bizarre
bj
bl
bla
black
blackberry
blackbird
blackbirds
blackboard
blackburn
blackbush
blackbushe
blackcurrant
blackcurrants
blacker
blackheads
blackheath
blackie
blackies
blackmail
blackman
blackpool
blacks
blacksmith
bladder
bladdered
blade
blades
blagden
blah
blake
blame
blamed
blaming
blanch
blanche
bland
blandford
blanes
blank
blanket
blankets
blanks
blaring
blasgo
blast
blasted
blasting
blatant
blatantly
blaydon
blayton
blazer
bleach
bleached
bleaches
bleak
bleasdale
bled
bleed
bleeder
bleeding
bleep
bleeper
blend
blended
blender
blenheim
bless
blessed
blessing
bleu
blew
blik
blimey
blimming
blind
blinded
blindfolded
blinding
blinds
blink
blinked
blinking
bliss
blister
blisters
blitz
blo
bloated
blob
blobby
blobs
block
blockage
blocked
blocking
blocks
bloggs
bloke
blokes
blond
blonde
blonk
blood
blooded
bloodshot
bloody
bloom
blooming
blop
blossom
blossoms
blot
blotches
blotto
blouse
blouses
blow
blowed
blower
blowers
blowing
blown
blows
blu
blub
blue
bluebird
bluer
blues
bluestry
bluey
bluff
bluffing
blunt
bluntly
blurb
blurgh
blythe
blyton
bo
boar
board
boarded
boarding
boards
boardwalk
boars
boast
boat
boati
boating
boats
bob
bobbie
bobble
bobblin
bobbly
bobby
bobs
bobsleigh
bod
boddington
boddingtons
boddys
bodge
bodged
bodger
bodice
bodies
bodily
bodin
body
bodyguard
bodyguards
bodywork
bog
bogey
bogeys
bogged
boggle
boggles
bogie
bogies
bognor
bogs
bogying
bohemian
boil
boiled
boiler
boilers
boiling
boils
boing
boisterous
bolcek
bold
bollard
bollards
bollock
bollocking
bollocks
bollocksed
bolly
bolognaise
bolognese
bolshie
bolshoi
bolster
bolsters
bolt
bolted
bolton
bolts
bolus
bom
bomb
bombarded
bombay
bombed
bomber
bombers
bombing
bombs
bomby
bomp
bon
bond
bondage
bonding
bonds
bone
bones
bonfire
bong
bongo
bonio
bonjella
bonjour
bonk
bonkers
bonking
bonks
bonnet
bonnie
bonny
bono
bonosa
bons
bonsai
bonsoir
bonus
bony
boo
boob
boobs
boof
boogey
boogie
boogieing
boojoo
book
bookcase
booked
bookers
bookies
booking
bookings
booklet
books
bookshelf
bookshop
boom
boone
boop
boos
boost
booster
boot
booth
bootiful
bootlace
bootleg
boots
booze
boozer
boozing
bop
bor
border
bordering
borderline
borders
bore
bored
boredom
borg
boring
borker
born
borough
boroughbridge
boroughs
borrow
borrowed
borrowing
borrows
borstal
bos
bosch
boss
bossed
bosses
bossing
bossy
boston
boswell
bosworths
bot
both
botham
bother
bothered
bothering
bothers
bots
botswana
bottle
bottled
bottles
bottom
bottoms
botty
bou
bough
bought
boulogne
bounce
bounced
bouncer
bounces
bouncing
bouncy
bound
boundaries
boundary
bounds
boung
bounty
bouquet
bouquets
bournemouth
boursin
bout
boutiques
bovril
bow
bowater
bowel
bowels
bowen
bowie
bowl
bowled
bowler
bowlful
bowling
bowls
bows
box
boxed
boxer
boxers
boxes
boxing
boy
boycott
boyfriend
boyfriends
boyos
boys
bozz
br
bra
brace
bracelet
bracelets
braces
bracing
bracken
bracket
brackets
bracknell
brad
braddock
bradford
bradley
bradleyscope
brady
brae
brag
bragging
braid
braille
brain
brainiest
brains
brainy
brake
braked
brakes
braking
brambles
brambury
bramont
brampton
bran
branch
branches
brand
brands
brandy
branson
brass
brassed
brassnick
brasso
brassy
brat
brave
bravest
brawls
bray
brayed
brazil
bre
brea
breacon
bread
breadcrumbs
breaded
break
breakdown
breaker
breakers
breakfast
breakfasts
breaking
breaks
breast
breasted
breasts
breath
breathe
breather
breathes
breathing
breaths
breckfield
brecon
bred
breed
breeding
breeze
breken
bren
brenda
brendan
brentford
brest
bretfords
brett
brew
brewed
breweries
brewery
brewing
brews
bri
brian
briar
bribe
bribery
brick
bricked
bricklayer
bricks
brickwork
brid
bride
brides
bridesmaid
bridesmaids
bridge
bridgemere
bridgenorth
bridges
bridget
bridgett
bridlington
brie
brief
briefcase
briefing
briefly
brigade
brigadier
briggs
bright
brighten
brightening
brighter
brightest
brightly
brightness
brighton
brill
brilliant
brilliantly
brillo
brim
brimstone
bring
bringing
brings
brink
brinley
briquettes
brisk
bristles
bristol
bristow
brit
britain
britains
britannia
british
brits
brittany
brittas
brittle
brixton
bro
broach
broad
broadcast
broadcasting
broader
broadstone
broadway
broccoli
brochure
brochures
brogue
broke
broked
broken
broker
brokers
brolly
brom
bromley
bromsgrove
bromswell
bronchitis
brooch
brook
brooke
brookside
broom
broomsticks
broth
brothel
brothels
brother
brotherhood
brotherly
brothers
brought
broule
brow
brown
browned
brownie
brownies
brownish
browns
brownstein
browny
browse
brr
brrr
brrrm
brrrr
brrrrrrrrrr
brubaker
bruce
bruges
bruise
bruised
bruises
brummie
brunch
brundish
brunel
brung
bruno
brurgh
brush
brushed
brushes
brushing
brussel
brussels
brutal
bry
bryan
bryant
bryony
bs
bt
bu
bub
bubber
bubble
bubbled
bubbles
bubbling
bubbly
bubby
bubye
buck
bucket
buckets
buckingham
buckley
bucks
bud
buddleia
buddy
budge
budget
budgie
budgies
buds
budweiser
buff
buffalo
buffer
buffet
buffs
bug
bugger
buggered
buggering
buggers
buggery
buggies
bugging
buggy
bugles
bugs
bugsy
build
builder
builders
building
buildings
builds
built
bul
bulb
bulbs
bulgaria
bulgarian
bulge
bulimia
bulk
bulky
bull
bulldog
bulldozer
bullet
bullets
bullied
bullies
bullmaster
bulls
bullshit
bully
bullying
bum
bumblebee
bumbling
bummer
bump
bumped
bumper
bumph
bumping
bumps
bumpy
bums
bun
bunch
bunches
bundle
bung
bungalow
bungalows
bungdidin
bunged
bunging
bungle
bunk
bunked
bunker
bunking
bunnies
bunny
buns
bunter
buoyancy
buoyant
bupa
bur
burbridge
burden
bureau
burger
burgers
burgh
burglar
burglaries
burglars
burgled
burgundy
buried
burk
burlington
burmps
burn
burned
burner
burning
burns
burnt
burp
burped
burps
bursar
burst
bursting
burton
burtons
bury
burying
burzoi
bus
buses
bush
bushes
bushey
bushy
busier
busiest
business
businesses
businessman
businessmen
busload
bust
busted
busters
busting
busy
but
butcher
butchers
butchery
butler
butlins
buts
butt
butter
buttered
butterflies
butterfly
buttering
buttery
butties
button
buttons
butty
buxton
buy
buyed
buyer
buyers
buying
buys
buzz
buzzer
buzzing
bwangdirola
by
bye
bypass
byron
bystanders
bytes
bzzzzzzzzzzzzzzz
c
ca
cab
cabaret
cabbage
cabbages
cabe
cabin
cabinet
cabinets
cable
cables
cabling
cabriolet
cack
cacking
cackle
cactus
cadbury
cadburys
caddy
cadenet
cadet
cadets
caernarfen
caernarfon
caernarvon
caerphilly
caesarian
cafe
cafeteria
cafetiere
cage
caged
cagey
cagney
cagoule
cagy
cain
caine
cairan
cajun
cake
cakes
cakey
cal
calais
calcium
calculate
calculated
calculating
calculation
calculations
calculator
calder
calendar
calendars
calf
calibre
calico
california
calkin
call
called
caller
calling
calliper
callous
callow
calls
callum
calm
calmed
calmer
calming
calmly
calor
calories
calpers
calpol
calpurnia
calves
calyx
cam
camber
camberley
cambridge
cambridgeshire
camcorder
camden
came
camel
camelia
camels
camera
cameraman
cameras
cameron
camomile
camouflage
camp
campaign
campaigning
campaigns
campbell
camping
campus
cams
can
canada
canadian
canal
canals
canaries
canary
cancel
cancellation
cancelled
cancelling
cancels
cancer
cancers
candice
candid
candidate
candidates
candle
candles
candlestick
candy
cane
caned
canister
canna
cannabis
cannae
canned
cannon
cannot
canny
canoe
canoeing
canoes
cans
cantankerous
canteen
canvas
canvases
canvass
canvassing
cap
capability
capable
capacity
cape
caper
capital
capitalism
capitalist
capitals
capitulate
capon
cappuccino
capri
caps
capstan
capsules
captain
caption
captivating
captivity
capture
captured
car
caramel
carat
caravan
caravanning
caravans
carbine
carbon
carbonara
carburettor
carcass
carcasses
card
cardboard
cardi
cardiff
cardigan
cardigans
cardinal
cards
cardy
care
cared
career
careers
careful
carefully
careless
carer
cares
caretaker
carey
caribbean
carina
caring
carl
carla
carlisle
carlos
carlsberg
carlton
carly
carmen
carnally
carnations
carne
carnel
caro
carol
carole
carolina
caroline
carolines
carols
carolyn
carousel
carp
carpenter
carpenters
carpet
carpeted
carpeting
carpets
carr
carreras
carriage
carriages
carriageway
carriageways
carrie
carried
carrier
carriers
carries
carrot
carrots
carry
carrycot
carrying
cars
carssier
carston
cart
carta
carte
carted
carter
carton
cartons
cartoon
cartoons
cartridge
cartridges
carts
cartwrights
carve
carved
carvers
carvery
carving
cas
case
cases
cash
cashed
cashew
cashews
cashier
casing
casings
casper
cass
cassata
casserole
cassette
cassettes
cassie
cassier
cast
caste
caster
casteratie
casters
casting
castle
castles
castors
castratie
casual
casually
casualty
cat
catalogue
catalogues
cataramie
catarrh
catastrophe
catastrophes
catch
catched
catcher
catches
catching
catchment
catchword
categor
categories
category
cater
catered
caterer
caterers
caterham
catering
caterpillar
caterpillars
cath
cathedral
catherine
catheter
catholic
catholics
cathy
catonica
catriona
cats
catterick
cattle
catty
catwalk
caught
cauldron
cauli
cauliflower
cauliflowers
cause
caused
causes
causeway
causing
cautious
cavalier
cave
caved
caveman
caves
cavey
caviar
cavity
cayleyed
cc
cd
ce
cease
ceased
ceasefire
cedar
ceiling
ceilings
celebrate
celebrated
celebrating
celebration
celebrity
celery
celia
cell
cellar
cellars
cello
cellophane
cells
celsius
cement
cemented
cemetery
cen
censored
censors
censorship
census
cent
centigrade
centimetres
central
centre
centres
cents
centuries
century
cer
cera
ceramic
cereal
cereals
ceremony
cerise
cert
certain
certainly
certainty
certificate
certificates
certification
certified
certs
cerys
ch
cha
chaff
chaffinch
chain
chained
chains
chainsaw
chair
chairman
chairs
chaise
chalet
chalets
chalk
challener
challenge
chamber
chamberlain
chamois
champagne
champers
champion
champions
championship
championships
chance
chancellor
chances
chanderel
chanel
change
changeable
changed
changeover
changes
changing
channel
channels
channing
chantal
chantel
chantry
chaos
chaotic
chap
chapel
chaplaincy
chaplin
chapman
chappie
chaps
chapter
chapters
char
character
characteristics
characters
charcoal
charge
charged
chargehand
charger
charges
charging
charing
charity
charlene
charles
charlie
charlies
charlotte
charm
charmaine
charmer
charming
charmwood
charollais
chart
charter
chartered
charts
chas
chase
chased
chaser
chasing
chasseur
chassie
chassis
chat
chateau
chats
chatted
chatter
chatterbox
chatterboxes
chattering
chatting
chatty
chaucer
chauffeur
che
cheam
cheams
cheap
cheaper
cheapest
cheaply
cheapo
cheapskates
cheapy
cheat
cheated
cheater
cheating
cheats
check
checked
checker
checkers
checking
checklist
checkoff
checkout
checks
cheddar
chee
cheek
cheekbones
cheekiest
cheeks
cheeky
cheer
cheered
cheerful
cheerfully
cheering
cheerio
cheers
cheese
cheeseburger
cheesecake
cheesed
cheeses
cheetah
chef
chell
chelle
chelmsford
chelsea
chelstons
cheltenham
chemical
chemicals
chemist
chemistry
chemists
chemotherapy
chenille
cheque
chequebook
cheques
cher
cherries
cherry
cherub
cheryl
cheshire
chess
chest
chested
chester
chesterfield
chestnut
chestnuts
chests
chesty
chevette
chew
chewchocks
chewed
chewing
chews
chewy
chi
chic
chicago
chichester
chick
chicken
chickened
chickening
chickenpox
chickens
chicks
chicky
chief
child
childhood
childish
childlike
childline
childminder
childminding
children
chili
chill
chilled
chilli
chillies
chilly
chiltern
chime
chimney
chimneys
chin
china
chinchilla
chinese
chinky
chinwag
chip
chipboard
chipped
chippendales
chippie
chipping
chippings
chippy
chips
chipsticks
chiropodist
chirpy
chisel
chislehurst
chit
chittering
chitty
chivalrous
chives
chloe
chlorinated
chlorine
cho
choc
choccies
chock
chocolate
chocolates
choice
choices
choir
choirs
choke
choked
choking
choleacs
cholera
cholesterol
chomp
chomping
choo
choos
choose
chooser
choosers
chooses
choosing
choosy
chop
chopped
chopping
chops
chopsticks
choral
chord
chore
choreography
chores
chorley
chorus
chose
chosen
chow
chr
chri
chris
chrissie
chrissy
christ
christchurch
christened
christening
christian
christians
christie
christies
christine
christmas
christmases
christmassy
christo
christopher
christy
chrome
chromosomes
chronic
chronicle
chronicles
chu
chub
chubby
chuck
chucked
chucking
chucks
chuddley
chudleigh
chuff
chuffed
chuffing
chug
chugga
chum
chummy
chump
chums
chung
chunk
chunks
chunky
chuntering
chur
church
churchill
churn
churned
churning
ci
ciao
cider
cig
cigar
cigarette
cigarettes
cigars
cigs
cilla
cinderella
cindy
cine
cinema
cinnamon
cinzano
circle
circles
circuit
circular
circulate
circulating
circulation
circumcision
circumstance
circumstances
circumstantial
circus
cities
citizen
citizens
citizenship
citreon
citric
citroen
city
civic
civil
civilian
civilization
civilized
civvies
cl
cla
clackmannan
clag
claim
claimant
claimed
claiming
claims
clair
claire
clairvoyants
clamp
clamped
clang
clanger
clanging
clank
clap
clapham
clapped
clapping
clapton
clara
clarabel
clare
claremont
clarendon
claret
clarice
clarify
clarinet
clark
clarke
clarkeston
clash
clashes
clashing
clasp
class
classed
classes
classic
classical
classics
classification
classified
classify
classroom
classrooms
clattering
claude
claus
clause
claustrophobic
claw
claws
clay
clayton
cle
clean
cleaned
cleaner
cleaners
cleanest
cleaning
cleanliness
cleanly
cleans
cleansing
clear
clearance
cleared
clearer
clearing
clearly
clears
clearwater
cleethorpes
clematis
clements
clenched
cleo
clerical
clerk
clerks
clever
cleverest
cleverness
cli
click
clicked
clicking
clicks
client
clientele
clients
cliff
clifford
cliffs
clifton
climate
climax
climb
climbed
climbing
climbs
cling
clingfilm
clings
clingy
clinic
clinical
clinics
clinique
clink
clint
clip
clipped
clipper
clippers
clipping
clips
clit
clitoris
clive
clo
cloak
cloakroom
clobber
clobbered
clock
clocked
clocking
clockish
clocks
clockwise
clockwork
clog
clogs
clonk
clop
close
closed
closely
closer
closes
closest
closet
closing
clot
cloth
clothed
clothes
clothing
cloths
cloud
clouds
cloudy
clout
clover
clown
clowns
club
clubs
clue
cluedo
clues
clump
clumpering
clumsy
clutch
clwyd
clyde
co
coach
coached
coaches
coaching
coal
coalite
coalman
coarse
coast
coasting
coat
coating
coats
cob
cobber
cobblers
cobwebs
coca
cochineal
cock
cockbrave
cocked
cocker
cockerel
cockle
cockney
cockroaches
cocks
cocktail
cocktails
cocky
coco
cocoa
cocoapops
cocodamol
coconut
coconuts
cod
code
codes
codger
coding
cody
coff
coffee
coffees
coffin
cogs
coherent
coil
coin
coincidence
coins
cointreau
coke
cokes
cokey
col
cola
colander
colchester
cold
colder
colds
cole
coleen
coleman
coleslaw
colgate
colic
colimore
colin
collage
collapse
collapsed
collapses
collapsing
collar
collarbone
collared
collars
collate
collateral
colleague
colleagues
collect
collected
collecting
collection
collections
collector
collects
college
colleges
collier
colliery
collins
colloquial
colloquialism
collymore
colman
colonel
colonies
colony
colossal
colostomy
colou
colour
coloured
colourful
colouring
colours
colts
columbia
column
columns
colwyn
com
coma
comas
comb
combat
combed
combination
combinations
combine
combined
combing
combs
come
comed
comedian
comedians
comedienne
comedy
comes
comet
comfort
comfortable
comfortably
comfy
comi
comic
comical
comics
coming
comma
command
commandeer
commander
commandment
commando
commas
comme
commencement
commended
comment
commented
comments
commercial
commercialized
commercially
commercials
commi
commission
commissionaires
commissioner
commissions
commit
commitment
commitments
commits
committal
committed
committee
committees
committing
commode
commodore
common
commonly
commons
commonsense
communal
communicate
communicating
communication
communications
communion
communism
communist
communities
community
commute
commuter
como
comp
compact
companies
companionship
company
comparative
comparatively
compare
compared
comparing
comparison
comparisons
compassion
compatible
compelled
compensate
compensates
compensation
compete
competing
competition
competitions
competitive
compilation
compile
compiling
complacent
complain
complained
complaining
complains
complaint
complaints
complement
complementary
complete
completed
completely
completion
complex
complexion
complicated
complicating
complication
complications
compliment
complimentary
compliments
comply
compo
composer
compost
compound
comprehend
comprehensive
compressors
comprising
compromise
compromising
compu
compulsory
computer
computerised
computerized
computers
computing
comrades
con
conasquay
conceal
conceited
conceive
conceived
concentrate
concentrated
concentrating
concentration
concept
conception
concern
concerned
concerning
concerns
concert
concerted
concertina
concerts
conclude
conclusion
conclusions
conclusive
concoction
concorde
concrete
concreted
concubine
condemned
condensation
condition
conditioned
conditioner
conditioners
conditioning
conditions
condom
condominium
condoms
conducive
conducting
conductor
cones
coney
conference
conferences
confess
confession
confessions
confidence
confident
confidential
confirm
confirmation
confirmed
confiscate
conflict
conform
confronted
confu
confuse
confused
confuses
confusing
confusion
conga
congas
congo
congratulations
congregation
congregations
conifer
coniferous
conifers
conjugate
conked
conker
conkers
conking
conley
conne
connect
connected
connecting
connection
connections
connector
connectors
conned
connell
connells
connery
connie
conning
connolly
connor
connors
conomy
conqueror
cons
consaquay
conscience
conscientious
conscious
consent
consequence
consequences
consequently
conservative
conservatives
conservatories
conservatory
conserve
consi
consider
considerable
considerably
considerate
consideration
considered
considering
considers
consigned
consisted
consistency
consistent
consistently
consists
consolation
console
conspiracy
conspired
constable
constabulary
constance
constant
constantly
constipation
constituency
constructed
construction
constructive
consul
consulate
consultant
consultants
consulted
consumed
consumer
consuming
consummated
consumption
contact
contacted
contacts
contagious
contain
contained
container
containers
contax
contemplating
contemporary
content
contented
contents
contest
contesting
context
continent
continental
contingency
continual
continually
continuation
continue
continued
continues
continuing
continuous
continuously
contortionist
contraception
contraceptive
contract
contracted
contracting
contractor
contractors
contracts
contraption
contrary
contrast
contribute
contributes
contributing
contribution
contributions
control
controlled
controller
controls
controversy
convalescing
convenience
convenient
convent
convention
conventional
conver
conversation
conversational
conversations
converse
conversing
convert
converted
convertible
converting
conveyor
convicted
conviction
convince
convinced
convincing
convoy
conway
conways
coo
cooee
cooeee
cook
cooked
cooker
cookers
cookery
cookie
cookies
cooking
cooks
cookson
cool
cooled
cooler
coolers
cooling
cools
coop
cooped
cooper
coopers
coordinate
coordinator
coot
cop
copacabana
cope
coped
copenhagen
copied
copies
coping
copped
copper
coppers
cops
copter
copy
copydex
copying
cor
corbett
corby
cord
cordless
cordon
cordons
cords
core
corfe
corgi
corgis
corinne
corinthians
cork
corker
corkscrew
corn
cornea
corned
corner
cornered
corners
cornerstone
cornet
cornflakes
cornflour
cornice
cornish
corns
cornwall
coroma
corona
coronation
coronations
coronet
corporal
corporation
corpse
corpses
corpus
correct
corrected
correction
corrections
correctly
correlate
correlation
correspond
correspondence
correspondent
corridor
corridors
corrinne
corrugated
corrupt
corrupted
corruption
corrupts
corset
cortina
cortisone
cos
cosh
cosi
cosmetic
cosmetics
cosner
cost
costas
costed
costing
costly
costs
costume
costumes
cosy
cot
cottage
cottages
cotton
cottoned
cottoney
cottony
cou
couch
cough
coughed
coughing
coughs
coul
could
couldn
coun
council
councillor
councillors
councils
counsel
counselled
counselling
counsellor
count
countdown
counted
countenance
counter
counteract
counteracts
counters
countersign
counties
counting
countries
countrified
country
countryside
counts
county
coup
couple
coupled
couples
coupon
coupons
courage
courgette
courgettes
courier
couriers
course
courses
coursework
court
courteous
courtesy
courting
courtney
courts
courtyard
cousin
cousins
coved
covent
coventry
cover
coverage
covered
covering
coverings
covers
coveted
coving
cow
cowabongga
cowabunga
cowboy
cowboys
cowed
cowley
cows
cox
coxes
coypu
cr
cra
crab
crabs
crack
cracked
cracker
crackers
cracking
crackle
crackling
cracks
crackside
craft
craftsmanship
crafty
craig
craigar
craigs
craigy
crammed
cramming
cramond
cramp
cramping
cramps
cranberry
crane
crank
crankonizers
crap
crapped
crapper
crappy
crash
crashed
crashes
crashing
crate
crates
cravat
crave
craving
crawford
crawl
crawled
crawley
crawling
crayon
crayoning
crayons
craythorn
craze
crazy
cre
creak
creaking
cream
creams
creamy
crease
creased
create
created
creates
creating
creative
creature
creatures
creche
cred
creda
credit
credited
credits
creek
creep
creeping
creeps
creepy
crematorium
creme
creosote
crept
crescendo
cress
crest
crew
crewe
cri
crib
crick
cricket
cricketer
cricketers
cried
cries
crikey
crime
crimes
criminal
criminals
criminology
crimson
cringe
cringing
crinkle
crinkled
crinkly
cripple
crippled
crippler
crippling
crisis
crisp
crispen
crispies
crisps
crispy
criss
cristleton
criteria
critical
criticise
criticised
criticising
criticism
criticisms
criticize
criticized
criticizing
critics
croak
croatia
crocker
crockery
crocodile
croft
crofters
croftman
croissants
cromer
crook
crooked
crop
cropped
cropper
crops
croquet
cross
crossbar
crossed
crosses
crossing
crossings
crossroads
crossword
crosswords
crotchet
crotchets
crowd
crowded
crowding
crowds
crowing
crowle
crown
crowned
crows
crowston
croydon
crucial
crucible
crude
cruel
cruelty
crufts
cruise
cruising
crumble
crumbly
crumbs
crummy
crumpalls
crumpets
crunch
crunched
crunchie
crunchies
crunching
crunchy
cruse
crush
crushed
crushes
crushing
crust
crusts
crusty
crutch
crutches
crutchless
crux
cry
crying
crystal
crystallised
crystals
cs
cu
cub
cubby
cube
cubed
cubes
cubical
cubicle
cubs
cuckoo
cucumber
cuddle
cuddled
cuddles
cuddling
cuddly
cue
cues
cuff
cuffs
cull
culottes
cultivated
culture
cultured
cultures
cum
cumb
cumbria
cunning
cunt
cunts
cup
cupboard
cupboards
cupful
cuppa
cuprinol
cups
cur
curb
curd
curds
cure
cured
curfew
curiosity
curious
curl
curled
curler
curlies
curling
curls
curly
curran
currane
currant
currants
currencies
currency
current
currently
curricula
curriculum
curried
curries
curry
curse
curses
cursor
curtain
curtains
curve
curved
cushion
cushions
cuss
custard
custody
custom
customary
customer
customers
customs
cut
cute
cuter
cutey
cutlery
cuts
cutter
cutters
cutting
cuttings
cybilia
cycle
cycled
cycles
cycling
cyclist
cyclists
cygerly
cylinder
cylinders
cymbals
cynical
cynth
cynthia
cypriot
cyprus
cyril
d
da
dab
dabble
dabi
dad
dada
daddies
daddy
dado
dads
daff
daffodil
daffodils
daffs
daffy
daft
dagfields
dagger
dahlia
daily
dainty
dairy
dairylea
daisies
daisy
dale
dalek
daley
dallas
dallied
dally
dalston
dam
damage
damaged
damaging
dame
damien
damn
damned
damp
dampness
dan
dance
danced
dancer
dancers
dances
dancey
dancing
dandeanee
dandruff
dandy
dane
dang
danger
dangerous
dangle
dangling
daniel
danielle
daniels
danii
danish
danna
dannii
danny
daphne
dar
dare
dared
daren
dares
daresay
daring
dark
darker
darkish
darkness
darky
darling
darlings
darlington
darn
darned
darrel
darren
dart
dartboard
dartford
darth
dartmoor
darts
darwin
daryl
daryll
das
dash
dashboard
dashed
dashing
dastardly
data
database
date
dated
dateline
dates
dating
datsun
daughter
daughters
dave
davenport
daves
davey
david
davidson
davies
davis
davro
davy
davydd
dawn
dawned
dawson
day
daylight
daynurse
days
daytime
daz
dazzle
dazzling
de
deacon
dead
deadline
deadly
deaf
deafened
deafness
deal
dealer
dealers
dealing
dealings
deals
dealt
dean
deana
deane
deanne
dear
dearer
dearest
dearie
dearly
dears
deary
death
deaths
deb
debate
debating
debbie
debby
debdens
debenham
debenhams
debit
debonair
deborah
debris
debs
debt
debts
dec
decadence
decaffeinated
decameron
decanters
decay
deceased
deceive
december
decency
decent
decently
deci
decide
decided
decides
deciding
decimal
decipher
decision
decisions
decisive
deck
decker
decks
declan
declare
declared
decline
decoder
decor
decorate
decorated
decorating
decoration
decorations
decorative
decorator
decorators
decreed
decrepit
ded
deddle
dedicated
dedicating
deduct
deduction
deductions
dee
deeds
deejaying
deep
deeper
deeply
deer
deeside
def
defeat
defeated
defeats
defect
defence
defences
defend
defender
defenders
defending
defied
defies
define
defined
definite
definitely
definition
definitions
deflate
deformed
deformity
defrost
degenerate
degrading
degree
degrees
deh
deirdre
dejection
del
delay
delayed
delays
delegate
delegates
delete
deleted
deleting
deli
deliberate
deliberately
delicacy
delicate
delicatessen
delicious
delight
delighted
delightful
delilah
deliver
delivered
deliveries
delivering
delivers
delivery
delphiniums
demand
demanded
demanding
demisemiquaver
demisters
demo
democrat
democrats
demolished
demolition
demon
demons
demonstrate
demonstrating
demonstration
den
denied
denies
denim
denise
denman
denmark
dennington
dennis
density
dent
dental
dented
dentist
dentists
deny
deodorant
dep
depar
depart
departement
department
departmental
departments
depend
depended
dependent
depending
depends
deported
deposit
depot
depots
depreciation
depress
depressant
depressed
depressing
depression
deprived
deptford
depth
depths
deputy
der
derby
derbyshire
derek
derelict
derogatory
derry
des
descent
describe
described
describes
describing
description
descriptions
descriptive
deselect
desert
deserted
deserts
deserve
deserved
deserves
design
designed
designer
designing
designs
desirable
desired
desk
desks
desmond
despair
despatch
desperado
desperate
desperately
desperation
despised
despite
despondent
dessert
desserts
dessie
dessy
destiny
destitute
destroy
destroyed
destroying
destroys
destruct
destruction
detached
detail
detailed
details
detective
detectives
detector
detention
deter
detergent
deteriorate
deteriorated
deteriorating
determine
determined
determining
deterrent
deters
detest
detour
detrunk
dettol
deutschmark
develop
developed
developing
development
developments
develops
deviating
device
devices
devil
devils
devious
devised
devizes
devon
devoted
devoured
dexterous
di
dia
diabetes
diabetic
diabolical
diagnosed
diagonal
diagonally
diagram
dial
dialect
dialects
dialled
dialling
dials
dialysis
diameter
diamond
diamonds
diana
diane
dianne
diarrhoea
diary
diazepam
dib
dice
dices
dick
dicken
dickens
dickhead
dickheads
dickie
dicks
dickson
dicky
dictaphones
dictate
dictation
dictatorship
dictionaries
dictionary
did
diddle
diddly
diddy
didn
didnae
die
died
diego
dieppe
dies
diesel
diet
dietician
dieting
diets
diety
dif
diff
difference
differences
different
differentiate
differentiation
differently
diffi
difficult
difficulties
difficulty
diffuser
diffusion
dig
digby
digest
digestive
digged
digger
diggers
digging
digit
digital
dignitaries
digs
dike
dilley
dillied
dilly
dim
dimbleby
dimension
dimmed
dimples
din
diner
ding
dingbats
dingleside
dingy
dining
dinkly
dinky
dinner
dinners
dinnertime
dino
dinosaur
dinosaurs
dip
diploma
dipped
dipping
dips
dipstick
dir
direct
directing
direction
directional
directions
directly
director
directors
directory
dirt
dirties
dirtiest
dirtiness
dirty
dis
disa
disability
disabled
disadvantage
disadvantages
disagree
disagreed
disagrees
disallowance
disallowed
disappear
disappeared
disappearing
disappears
disappoint
disappointed
disappointing
disappointment
disaster
disasters
disastrous
disc
discharge
disciples
disciplinary
discipline
disciplined
disco
discomfort
disconnect
disconnected
discontent
discontented
discos
discount
discover
discovered
discovery
discreet
discrepancies
discrepancy
discs
discus
discuss
discussed
discussing
discussion
discussions
disease
diseases
disgrace
disgraceful
disgruntled
disguise
disguises
disgust
disgusted
disgusting
dish
dishcloths
dished
dishes
dishing
dishwasher
disillusioned
disintegrated
disjointed
disk
diskette
disks
dislike
dislikes
dislocated
dislodged
dismal
dismantle
dismantled
dismayed
dismiss
dismissal
disney
disobey
disorder
disorganised
disorganized
dispatch
dispense
displacement
display
displayed
displays
disposable
disposal
dispose
disposed
disqualified
disregard
disrespect
disrespectful
disrupting
dissatisfied
dissertation
dissolve
dissolved
distance
distances
distant
distinct
distinction
distinctive
distinctly
distinguish
distorted
distract
distracted
distress
distressed
distribution
distributor
district
disturb
disturbance
disturbed
disturbing
ditch
ditched
dither
dithered
ditto
diva
divan
dive
dived
divide
divided
dividend
divides
dividing
diving
division
divisions
divorce
divorced
divulge
dixon
dixons
dizzy
dj
djs
do
dob
doberman
doc
doch
docile
dock
docked
docks
doctor
doctors
document
documentaries
documentary
documents
dodd
doddery
doddle
dodge
dodgy
doe
does
doesn
dog
doggie
doggies
doggy
dogs
dogsbody
doh
doi
doing
doke
dokey
dole
doll
dollar
dollars
dollies
dolls
dolly
dolomite
dolores
dolphins
dom
domain
dome
domestic
domestics
dominant
dominated
dominic
dominiques
dominoes
domp
don
donald
donate
donated
donation
donations
doncaster
done
donegal
donegall
donegan
dong
donkey
donkeys
donna
donne
donnington
donny
donovan
doo
dooby
doodle
doodles
doolally
doolittle
doolly
doom
doomed
doompah
doon
doopsey
door
doorbell
doors
doorstep
doorway
dope
dopey
dor
dora
dorchester
doreen
dorian
doris
dorm
dorothy
dors
dorset
dos
dosage
dose
doses
dosh
doss
dossy
dot
dots
dotted
dotty
double
doubled
doubles
doubling
doubly
doubt
doubted
doubtful
doubts
doug
dougan
dough
doughnut
doughnuts
doughs
dougie
douglas
dove
dover
doves
dow
dowdy
dowel
dowels
down
downer
downfall
downhill
downright
downs
downstairs
downtown
downward
downwards
doz
doze
dozen
dozens
dozing
dozy
dr
dra
drab
drachma
dracula
draft
drag
dragged
dragging
dragon
drags
drain
drainage
drained
draining
drainpipe
drains
drake
drakes
dralon
drama
dramatic
dramatically
drank
drape
draped
drastic
drastically
drat
draught
draughts
draughtsman
draughty
draw
drawback
drawed
drawer
drawers
drawing
drawings
drawn
draws
dre
dread
dreaded
dreadful
dreading
dream
dreamed
dreamer
dreaming
dreams
dreamt
dreary
drenched
dress
dressed
dresser
dresses
dressing
dressmaking
dressy
drew
dreyfuss
dri
dribble
dribbled
dribbles
dribbling
dried
drier
driers
dries
driffield
drift
drifts
drill
drilled
drilling
drills
drink
drinkie
drinkies
drinking
drinks
drinky
drip
dripped
dripping
drippy
drips
drive
driven
driver
drivers
drives
driveway
driveways
driving
drizzly
dro
droitwich
droopy
drop
dropped
dropping
droppings
drops
droughts
drove
drown
drowned
drowning
drowsy
drug
druggy
drugs
drum
drummer
drummers
drumming
drums
drumsticks
drunk
drunken
drunks
dry
dryer
drying
ds
dsa
du
dual
duane
dub
dubai
dubbed
dubbing
dubious
dublin
duchess
duck
ducked
duckling
ducklings
ducks
duckworth
dud
dude
dudes
dudley
due
duel
duet
duff
duffel
dug
duke
dulgate
dull
dulux
dulwich
duly
dum
dumb
dummy
dump
dumped
dumping
dumpling
dumplings
dumpty
dumpy
dun
dunbar
duncan
dunce
dundee
dundonald
dungarees
dungy
dunkirk
dunlop
dunn
dunne
dunnit
dunno
dunscroft
duper
duplicate
duplo
dupont
dur
durability
duran
duration
durham
during
dusk
dust
dustbin
dusted
duster
dusters
dustin
dusting
dustman
dusty
dutch
duties
duttons
duty
duvane
duvet
duvets
dwarf
dwarfs
dwayne
dye
dyed
dyeing
dyes
dying
dyke
dylan
dyllis
dynamic
dynamike
dynamite
dynasty
dyslexic
e
ea
each
eager
eagle
eagles
ealing
eamon
ear
earache
eargh
earhole
earholes
earl
earlier
earlies
earliest
early
earn
earned
earnest
earning
earnings
earns
earnt
earphones
earplugs
earring
earrings
ears
earth
earthquake
eas
ease
eased
easier
easiest
easily
east
eastbourne
eastenders
easter
eastern
eastgate
eastville
eastwick
eastwood
easy
easygoing
eat
eaten
eater
eaters
eating
eaton
eats
ebonezer
ec
echo
eck
eclair
eclairs
econom
economic
economical
economics
economies
economise
economizing
economy
ecstasy
ecstatic
eczema
ed
edale
edam
edd
eddie
eddy
eden
edgar
edge
edger
edges
edgeways
edgeworth
edging
edgy
edible
edie
edinburgh
edit
edited
edith
editing
edition
editions
editor
editorial
edminton
edmonds
edmund
edmunds
edna
edu
educate
educated
educating
education
educational
edward
edwards
ee
eeeuk
eejit
eel
eels
eerie
effect
effecting
effective
effectively
effects
efficiency
efficient
effing
effort
efforts
egbert
egg
eggs
ego
egypt
egyptian
egyptians
eh
ehm
ei
eiffel
eigh
eight
eighteen
eighteenth
eighth
eighths
eighties
eights
eighty
eileen
einstein
eire
either
ejaculated
ejaculation
eject
ejected
ekland
el
elaborate
elaine
elastic
elbow
elbows
elder
eldercar
elderly
elders
eldest
ele
eleanor
elected
election
elections
electric
electrical
electrician
electricity
electrics
electrification
electro
electrocute
electrodes
electron
electronic
electronics
elegant
elegies
element
elementary
elements
elephant
elephants
elevated
elevator
eleven
elevens
elevenses
eleventh
eligible
eliminated
elissia
elite
elixir
eliza
elizabeth
elizabethan
ell
ella
elland
ellen
ellesmere
ellie
elliel
elliot
elliott
ello
ells
elly
elm
elmchurch
elsa
else
elses
elsewhere
elsie
elton
elvis
ely
em
emb
embankment
embarrass
embarrassed
embarrassing
embarrassment
embassy
embedded
embroidery
emerald
emeralds
emergencies
emergency
emigrate
emigrated
emily
emlyn
emm
emma
emmanuelle
emmerdale
emotional
emotionally
empathy
emphasis
emphasise
empire
employ
employed
employee
employees
employer
employers
employing
employment
employs
emptied
empty
emptying
emulate
emulsion
en
ena
enable
enabled
enables
enact
enacted
enamel
enclave
enclosed
enclosing
encountered
encourage
encouraged
encouragement
encourages
encouraging
encyclopedia
end
endear
ended
ending
endings
endless
endorphin
endowment
ends
enemies
enemy
energetic
energy
enfield
enforce
eng
engaged
engagement
engaging
engin
engine
engineer
engineering
engineers
engines
england
english
englishman
englishmen
engrossed
enhance
enhancement
enid
enjoy
enjoyable
enjoyed
enjoying
enjoyment
enjoys
enlarge
enlarged
enlighten
enlightened
enoch
enormous
enormously
enough
enquire
enquired
enquiries
enquiring
enquiry
enrolled
ensla
ensuite
ensure
entail
enter
entered
entering
enterprise
enters
entertain
entertaining
entertainment
enthusiasm
enthusiastic
enticed
entire
entirely
entitled
entitlement
entrance
entrances
entries
entry
envelope
envelopes
environment
environmental
environmentally
envisage
envy
enya
epi
epicure
epidemic
epilady
episode
episodes
epitaph
eppy
epsom
equal
equalize
equalizer
equalled
equally
equals
equation
equations
equinox
equipment
equipped
equity
equivalent
er
era
eran
erase
erased
ercalyps
ercoles
ercols
ere
erection
erections
ergh
erh
eric
erica
erin
erm
erms
ernest
ernie
ero
erotic
err
errand
erratic
errol
error
errors
ers
erupt
eruption
es
escalate
escalator
escape
escaped
escapes
escaping
escort
escorts
escudos
eskdale
especial
especially
esquire
essay
essays
essence
essential
essentially
essentials
essex
esso
est
established
establishment
estate
estates
esteem
esteemed
estefan
estimate
estimated
estimates
estimating
estuary
etc
etcetera
eternity
ethel
ethics
ethiopia
ethnic
ethnicity
etiquette
etonians
eugene
eugenie
eurhythmics
euro
eurodisney
europe
european
eurovision
euston
ev
eva
evacuated
evaluate
evaporated
evaporation
eve
evelyn
even
evening
evenings
event
events
eventually
ever
evergreen
everlasting
everley
everthing
everton
every
everybo
everybody
everyday
everyone
everything
everywhe
everywhere
evesham
evicted
eviction
evidence
evidently
evil
evolution
ex
exa
exact
exactly
exaggerate
exaggerated
exaggerating
exaggeration
exam
examination
examine
examined
examiner
